Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOption Property
 An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingHostByElementsInDesignOption { get; }
Public Shared ReadOnly Property ConfusingHostByElementsInDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingHostByElementsInDesignOption {
	FailureDefinitionId^ get ();
}
static member ConfusingHostByElementsInDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace